# -----------------------------------'
# Installing casks...
# -----------------------------------'

# Password manager that keeps all passwords secure behind one password
cask '1password'

# Command-line interface for 1Password
cask '1password-cli'

# GPU-accelerated terminal emulator
cask 'alacritty'

# Enable Windows-like alt-tab
cask 'alt-tab'

# Redis desktop manager
cask 'another-redis-desktop-manager'

# Speech-to-text system
cask 'aqua-voice'

# Japanese input method editor (IME) produced by JustSystems
cask 'atok'

# Utility that prevents the system from going to sleep
cask 'caffeine'

# Terminal-based AI coding assistant
cask 'claude-code'

# Screen capturing tool
cask 'cleanshot'

# Plain-text editor for web pages, program source codes and more
cask 'coteditor'

# Server and cloud storage browser
cask 'cyberduck'

# Monitors and peripherals manager
cask 'ddpm'

# Voice and text chat software
cask 'discord'

# App to build and share containerised applications and microservices
cask 'docker-desktop'

# Web browser
cask 'firefox'

# None
cask 'font-fira-code-nerd-font'

# None
cask 'font-hack-nerd-font'

# None
cask 'font-jetbrains-mono'

# None
cask 'font-jetbrains-mono-nerd-font'

# None
cask 'font-noto-sans-cjk-jp'

# None
cask 'font-noto-sans-mono'

# None
cask 'font-noto-serif-cjk-jp'

# Web browser
cask 'google-chrome'

# Issue reader for GitHub
cask 'jasper-app'

# JetBrains tools manager
cask 'jetbrains-toolbox'

# Menu bar manager
cask 'jordanbaird-ice'

# Keyboard customiser
cask 'karabiner-elements'

# GPU-based terminal emulator
cask 'kitty'

# Privacy-first, open-source platform for knowledge sharing and management
cask 'logseq'

# Shows the next meeting in the menu bar
cask 'meetingbar'

# Orchestrates virtual Ubuntu instances
cask 'multipass'

# App to write, plan, collaborate, and get organised
cask 'notion'

# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'

# Control your tools with a few keystrokes
cask 'raycast'

# Team communication and collaboration software
cask 'slack'

# Configuration application for the Ultimate Hacking Keyboard
cask 'uhk-agent'

# Open-source code editor
cask 'visual-studio-code'

# Web browser with built-in email client focusing on customization and control
cask 'vivaldi'

# Network protocol analyzer
cask 'wireshark-app'


# -----------------------------------'
# Installing formulae...
# -----------------------------------'

# Run your GitHub Actions locally
brew 'act'

# Static checker for GitHub Actions workflow files
brew 'actionlint'

# Automate deployment, configuration, and upgrading
brew 'ansible'

# Java build tool
brew 'ant'

# A database toolkit
brew 'atlas'

# Tool for generating GNU Standards-compliant Makefiles
brew 'automake'

# Official Amazon AWS command-line interface
brew 'awscli'

# Bourne-Again SHell, a UNIX command interpreter
brew 'bash'

# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'

# Parser generator
brew 'bison'

# Yet another cross-platform graphical process/system monitor
brew 'bottom'

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'btop'

# A CLI for building apps using Cloud Native Buildpacks
brew 'pack'

# Vi-like binary file (hex) editor
brew 'bvi'

# Cross-platform make
brew 'cmake'

# GNU File, Shell, and Text utilities
brew 'coreutils'

# Get, unpack, build, and install modules from CPAN
brew 'cpanminus'

# Tool for interacting with remote images and registries
brew 'crane'

# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'

# Compiler for writing C extensions for the Python language
brew 'cython'

# Convert ASCII diagrams into proper bitmap graphics
brew 'ditaa'

# Generate documentation for several programming languages
brew 'doxygen'

# Embeddable SQL OLAP Database Management System
brew 'duckdb'

# GNU Emacs text editor
brew 'emacs'

# Run arbitrary commands when files change
brew 'entr'

# Simple, fast and user-friendly alternative to find
brew 'fd'

# Plugin manager for the Fish shell
brew 'fisher'

# Fast and Lightweight Logs and Metrics processor
brew 'fluent-bit'

# None
brew 'sops-sakura-kms'

# Command-line fuzzy finder written in Go
brew 'fzf'

# GitHub command-line tool
brew 'gh'

# Distributed revision control system
brew 'git'

# Git extension for versioning large files
brew 'git-lfs'

# Task is a task runner/build tool that aims to be simpler and easier to use
brew 'go-task'

# Graph visualization software from AT&T and Bell Labs
brew 'graphviz'

# Packer
brew 'packer'

# C/C++ and Java libraries for Unicode and globalization
brew 'icu4c@76'

# Terminal-based textual UI for Terraform
brew 'tftui'

# Tools and libraries to manipulate images in many formats
brew 'imagemagick'

# Top clone for MySQL
brew 'innotop'

# Interactive computing in Python
brew 'ipython'

# Manage your Java environment
brew 'jenv'

# Image manipulation library
brew 'jpeg'

# Lightweight and flexible command-line JSON processor
brew 'jq'

# Handy way to save and run project-specific commands
brew 'just'

# runn is a tool for running operations following a scenario.
brew 'runn'

# tbls is a CI-Friendly tool for document a database, written in Go.
brew 'tbls'

# Kubernetes CLI To Manage Your Clusters In Style!
brew 'k9s'

# Run local Kubernetes cluster in Docker
brew 'kind'

# None
brew 'func'

# None
brew 'quickstart'

# None
brew 'kn'

# Fast and powerful Git hooks manager for any type of projects
brew 'lefthook'

# Multi-format archive and compression library
brew 'libarchive'

# BSD-style licensed readline alternative
brew 'libedit'

# GNOME XML library
brew 'libxml2'

# Powerful multi-lingual file viewer/grep
brew 'lv'

# None
brew 'mkr'

# Mac App Store command-line interface
brew 'mas'

# Bulk replace GitHub Actions references from version tags to commit hashes for locked, reproducible workflows.
brew 'actionspin'

# Scalable distributed version control system
brew 'mercurial'

# MinIO Client for object storage and filesystems
brew 'mc'

# Polyglot runtime manager (asdf rust clone)
brew 'mise'

# Simple tool to make locally trusted development certificates
brew 'mkcert'

# Tail multiple files in one terminal simultaneously
brew 'multitail'

# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'

# Network grep
brew 'ngrep'

# Network Kanji code conversion Filter (NKF)
brew 'nkf'

# Port scanning utility for large networks
brew 'nmap'

# Prometheus exporter for machine metrics
brew 'node_exporter'

# Libraries for security-enabled client and server applications
brew 'nss'

# AI coding agent, built for the terminal
brew 'opencode'

# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew 'opentofu'

# Swiss-army knife of markup format conversion
brew 'pandoc'

# Monitor PostgreSQL processes
brew 'pg_top'

# Package compiler and linker metadata toolkit
brew 'pkgconf'

# Object-relational database system
brew 'postgresql@13'

# Service monitoring system and time series database
brew 'prometheus'

# Protocol buffers (Google's data interchange format)
brew 'protobuf'

# Pretty, minimal and fast ZSH prompt
brew 'pure'

# File browser
brew 'ranger'

# Generate C-based recognizers from regular expressions
brew 're2c'

# Command-line tool for the Amazon S3 service
brew 's3cmd'

# Parallel S3 and local filesystem execution tool
brew 's5cmd'

# 
brew 'usacloud'

# Work with remote images registries
brew 'skopeo'

# Editor of encrypted files
brew 'sops'

# Tool to create intelligent and beautiful documentation
brew 'sphinx-doc'

# Compressed read-only file system for Linux
brew 'squashfs'

# Tool to enforce Swift style and conventions
brew 'swiftlint'

# User interface to the TELNET protocol
brew 'telnet'

# Send macOS User Notifications from the command-line
brew 'terminal-notifier'

# Code-search similar to ack
brew 'the_silver_searcher'

# Terminal multiplexer
brew 'tmux'

# Minimal, todo.txt-focused editor
brew 'todo-txt'

# Docker Compose Viewer - A TUI tool for monitoring Docker Compose applications
brew 'dcv'

# Taskeru - task management tool
brew 'taskeru'

# Find and verify credentials
brew 'trufflehog'

# Extremely fast Python package installer and resolver, written in Rust
brew 'uv'

# Pager/text based browser
brew 'w3m'

# Internet file retriever
brew 'wget'

# Lookup tool for domain names and other internet resources
brew 'whois'

# ISO9660+RR manipulation tool
brew 'xorriso'

# Yet another elegant Go interpreter
brew 'yaegi'

# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'yq'

# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew 'zellij'

# UNIX shell (command interpreter)
brew 'zsh'

# -----------------------------------'
# Installing mas(Mac app store)...
# -----------------------------------'

mas 'Cybozu Desktop', id: 905155357

mas 'Get Plain Text', id: 508368068

mas 'iMovie', id: 408981434

mas 'Keynote', id: 409183694

mas 'LINE', id: 539883307

mas 'MindNode Classic', id: 1289197285

mas 'Numbers', id: 409203825

mas 'Pages', id: 409201541

mas 'Pixelmator Pro', id: 1289583905

mas 'Xcode', id: 497799835

