# -----------------------------------'
# Installing casks...
# -----------------------------------'

# Password manager that keeps all passwords secure behind one password
cask '1password'

# Command-line interface for 1Password
cask '1password-cli'

# GPU-accelerated terminal emulator
cask 'alacritty'

# Enable Windows-like alt-tab
cask 'alt-tab'

# Chromium based browser
cask 'arc'

# Japanese input method editor (IME) produced by JustSystems
cask 'atok'

# Utility that prevents the system from going to sleep
cask 'caffeine'

# Screen capturing tool
cask 'cleanshot'

# Plain-text editor for web pages, program source codes and more
cask 'coteditor'

# Write, edit, and chat about your code with AI
cask 'cursor'

# App to build and share containerised applications and microservices
cask 'docker'

# API documentation viewer
cask 'dteoh-devdocs'

# Text editor
cask 'emacs'

# Web browser
cask 'firefox'

# None
cask 'font-fira-code-nerd-font'

# None
cask 'font-hack-nerd-font'

# None
cask 'font-jetbrains-mono'

# None
cask 'font-jetbrains-mono-nerd-font'

# None
cask 'font-noto-sans-cjk-jp'

# None
cask 'font-noto-sans-mono'

# None
cask 'font-noto-serif-cjk-jp'

# GitHub notifications on your menu bar
cask 'gitify'

# Web browser
cask 'google-chrome'

# Issue reader for GitHub
cask 'jasper'

# JetBrains tools manager
cask 'jetbrains-toolbox'

# Menu bar manager
cask 'jordanbaird-ice'

# Keyboard customiser
cask 'karabiner-elements'

# GPU-based terminal emulator
cask 'kitty'

# Privacy-first, open-source platform for knowledge sharing and management
cask 'logseq'

# Full TeX Live distribution with GUI applications
cask 'mactex'

# App to write, plan, collaborate, and get organised
cask 'notion'

# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'

# Control your tools with a few keystrokes
cask 'raycast'

# Team communication and collaboration software
cask 'slack'

# Configuration application for the Ultimate Hacking Keyboard
cask 'uhk-agent'

# Open-source code editor
cask 'visual-studio-code'

# Web browser with built-in email client focusing on customization and control
cask 'vivaldi'

# Network protocol analyzer
cask 'wireshark'


# -----------------------------------'
# Installing formulae...
# -----------------------------------'

# Static checker for GitHub Actions workflow files
brew 'actionlint'

# Automate deployment, configuration, and upgrading
brew 'ansible'

# Tool for generating GNU Standards-compliant Makefiles
brew 'automake'

# Official Amazon AWS command-line interface
brew 'awscli'

# Bourne-Again SHell, a UNIX command interpreter
brew 'bash'

# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'

# Parser generator
brew 'bison'

# Yet another cross-platform graphical process/system monitor
brew 'bottom'

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'btop'

# A CLI for building apps using Cloud Native Buildpacks
brew 'pack'

# Vi-like binary file (hex) editor
brew 'bvi'

# GNU File, Shell, and Text utilities
brew 'coreutils'

# Get, unpack, build, and install modules from CPAN
brew 'cpanminus'

# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'

# Run arbitrary commands when files change
brew 'entr'

# Plugin manager for the Fish shell
brew 'fisher'

# Command-line fuzzy finder written in Go
brew 'fzf'

# GitHub command-line tool
brew 'gh'

# Distributed revision control system
brew 'git'

# Git extension for versioning large files
brew 'git-lfs'

# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'

# Task is a task runner/build tool that aims to be simpler and easier to use
brew 'go-task'

# Graph visualization software from AT&T and Bell Labs
brew 'graphviz'

# Simple zero-configuration command-line HTTP server
brew 'http-server'

# Terminal-based textual UI for Terraform
brew 'tftui'

# Tools and libraries to manipulate images in many formats
brew 'imagemagick'

# Top clone for MySQL
brew 'innotop'

# Interactive computing in Python
brew 'ipython'

# Manage your Java environment
brew 'jenv'

# Image manipulation library
brew 'jpeg'

# Lightweight and flexible command-line JSON processor
brew 'jq'

# Handy way to save and run project-specific commands
brew 'just'

# None
brew 'func'

# None
brew 'quickstart'

# None
brew 'kn'

# BSD-style licensed readline alternative
brew 'libedit'

# Conversion library
brew 'libiconv'

# GNOME XML library
brew 'libxml2'

# C library for reading, creating, and modifying zip archives
brew 'libzip'

# Powerful multi-lingual file viewer/grep
brew 'lv'

# Drop-in replacement for MySQL
brew 'mariadb@10.11'

# Mac App Store command-line interface
brew 'mas'

# Run a Kubernetes cluster locally
brew 'minikube'

# MinIO Client for object storage and filesystems
brew 'mc'

# Polyglot runtime manager (asdf rust clone)
brew 'mise'

# Open source relational database management system
brew 'mysql@8.4'

# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'

# Network grep
brew 'ngrep'

# Network Kanji code conversion Filter (NKF)
brew 'nkf'

# Port scanning utility for large networks
brew 'nmap'

# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew 'opentofu'

# Swiss-army knife of markup format conversion
brew 'pandoc'

# Package compiler and linker metadata toolkit
brew 'pkgconf'

# Object-relational database system
brew 'postgresql@17'

# Pretty, minimal and fast ZSH prompt
brew 'pure'

# File browser
brew 'ranger'

# Generate C-based recognizers from regular expressions
brew 're2c'

# Search tool like grep and The Silver Searcher
brew 'ripgrep'

# Command-line tool for the Amazon S3 service
brew 's3cmd'

# Parallel S3 and local filesystem execution tool
brew 's5cmd'

# 
brew 'usacloud'

# Tool to create intelligent and beautiful documentation
brew 'sphinx-doc'

# User interface to the TELNET protocol
brew 'telnet'

# Send macOS User Notifications from the command-line
brew 'terminal-notifier'

# Code-search similar to ack
brew 'the_silver_searcher'

# Terminal multiplexer
brew 'tmux'

# Display directories as trees (with optional color/HTML output)
brew 'tree'

# High-performance data structure server that primarily serves key/value workloads
brew 'valkey'

# Pager/text based browser
brew 'w3m'

# Internet file retriever
brew 'wget'

# Yet another elegant Go interpreter
brew 'yaegi'

# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'yq'

# UNIX shell (command interpreter)
brew 'zsh'

# Tool for writing better scripts
brew 'zx'

# -----------------------------------'
# Installing mas(Mac app store)...
# -----------------------------------'

mas 'MindNode', id: 1289197285

mas 'LINE', id: 539883307

mas 'Pixelmator Pro', id: 1289583905

