# Homebrew パッケージ管理
# 適用: bin/brew-sync
# ADR-0015: macOS では Homebrew を優先

# === Taps ===
tap "nikitabobko/tap"       # aerospace
tap "felixkratz/formulae"   # borders, sketchybar
tap "sacloud/usacloud"      # usacloud
tap "k1low/tap"             # runn, tbls
tap "charmbracelet/tap"     # crush
tap "tokuhirom/tap"         # sops-sakura-kms, dcv, taskeru
tap "sqldef/sqldef"         # psqldef
tap "ariga/tap"             # atlas
tap "buildpacks/tap"        # pack

# === Shell ===
# ログインシェルは nix ではなく homebrew で管理
brew "zsh"
brew "bash"

# === Development Tools ===
# Build systems & compilers
brew "cmake"
brew "automake"
brew "ant"
brew "bison"
brew "re2c"

# Version control
brew "git"
brew "git-lfs"
brew "mercurial"
brew "lefthook"

# GitHub tools
brew "gh"
brew "actionlint"

# === Container & Cloud Tools ===
brew "docker"
brew "docker-compose"
brew "colima"
brew "kind"
brew "lazydocker"
brew "crane"
brew "skopeo"
brew "buildpacks/tap/pack"

# Cloud CLIs
brew "awscli"

# === Infrastructure as Code ===
brew "ansible"
brew "opentofu"
brew "ariga/tap/atlas"

# === Databases & Data Tools ===
brew "postgresql@14"
brew "duckdb"

# === Programming Languages & Tools ===
# Python
brew "ipython"
brew "cython"
brew "uv"

# Lua
brew "luarocks"
brew "luacheck"

# Perl
brew "perl"

# Rust (cargo 含む)
brew "rust"

# Swift
brew "swiftlint"

# === CLI Utilities ===
# File & text processing
brew "fd"
brew "ripgrep"
brew "the_silver_searcher"
brew "bat"
brew "fzf"
brew "jq"
brew "yq"
brew "pandoc"
brew "nkf"
brew "lv"
brew "bvi"

# System monitoring
brew "bottom"
brew "btop"
brew "entr"
brew "multitail"

# File managers & viewers
brew "ranger"
brew "w3m"

# Networking tools
brew "curl"
brew "wget"
brew "nmap"
brew "ngrep"
brew "whois"
brew "inetutils"

# === Task Runners & Build Tools ===
brew "go-task"
brew "just"

# === Certificates ===
brew "mkcert"

# === Security & Secrets ===
brew "sops"
brew "sops-sakura-kms"

# === S3 & Cloud Storage ===
brew "s3cmd"
brew "s5cmd"

# === Documentation & Diagrams ===
brew "doxygen"
brew "sphinx-doc"
brew "ditaa"
brew "graphviz"

# === Text Editors ===
brew "vim"
brew "neovim"
brew "emacs"

# === Build Tools ===
brew "make"

# === Programming Languages ===
brew "python@3"
brew "ruby"

# === CLI Utilities ===
brew "tree"
brew "htop"
brew "parallel"
brew "xz"
# === Libraries ===
brew "coreutils"
brew "libedit"
brew "libxml2"
brew "nss"
brew "pkgconf"
brew "protobuf"
brew "icu4c"
brew "jpeg"
brew "imagemagick"

# === Terminal Multiplexers ===
brew "zellij"
brew "tmux"

# === Runtime Manager ===
brew "mise"

# === macOS Specific ===
brew "borders"
brew "terminal-notifier"

# === SAKURA Cloud & Custom Tools ===
brew "usacloud"
brew "crush"
brew "dcv"
brew "opencode"
brew "sqldef/sqldef/psqldef"

# AI
brew "ollama"

# Mac 関連
brew "mas" # コマンドラインで mac app store アプリを操作

# === GUI Applications (Casks) ===

# Password & Security
cask "1password"
cask "1password-cli"

# Window Management
cask "aerospace"
cask "alt-tab"
cask "raycast"
cask "karabiner-elements"
cask "hammerspoon"

# Terminal Emulators
cask "alacritty"
cask "ghostty"
cask "wezterm"

# AI & Coding Assistants
cask "claude-code"
cask "tokuhirom/tap/notebeam"
cask "tokuhirom/tap/sakpilot"

# Web Browsers
cask "google-chrome"
cask "google-chrome@canary"
cask "firefox"
cask "vivaldi"

# Communication
cask "slack"
cask "discord"

# Development Tools
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Text Editors
cask "coteditor"

# Productivity & Note-taking
cask "obsidian"
cask "logseq"

# Utilities
cask "cleanshot"
cask "caffeine"
cask "meetingbar"
cask "jordanbaird-ice"
cask "cyberduck"
cask "ddpm"
cask "wireshark-app"
cask "uhk-agent"

# Cloud & Virtualization
cask "multipass"

# Japanese Input (IME)
cask "atok"
cask "aqua-voice"

# GitHub Tools
cask "jasper-app"

# AI
cask "codex"
cask "codex-app"

# Fonts
cask "font-cica"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-jp"
cask "font-noto-sans-mono"
cask "font-noto-serif-cjk-jp"

# === Mac App Store ===
mas "Get Plain Text", id: 508368068
mas "LINE", id: 539883307
mas "MindNode Classic", id: 1289197285
mas "Pixelmator Pro", id: 1289583905
mas "Xcode", id: 497799835
