adobe-source-han-sans-jp-fonts
adobe-source-han-serif-jp-fonts
alsa-utils
autoconf
automake
awesome
barrier
base
binutils
bison
cronie
dialog
efibootmgr
exo
fakeroot
fcitx
fcitx-configtool
fcitx-kkc
fcitx-qt5
firefox
flex
fzf
garcon
gcc
gdb
git
gnu-netcat
groff
grub
gvim
i3lock
iw
jdk11-openjdk
libreoffice-fresh
linux
linux-firmware
m4
make
man-db
man-pages
mlocate
mousepad
netctl
networkmanager
ngrep
noto-fonts-cjk
nvidia
openconnect
openssh
orage
otf-ipafont
pacman-contrib
parole
patch
pavucontrol
perl-lwp-protocol-https
pkgconf
pkgfile
pulseaudio
python
python-keyring
python-keyrings-alt
python-pip
ristretto
rofi
ruby
rust
rxvt-unicode
skktools
sudo
terminator
texinfo
the_silver_searcher
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
tmux
tree
ttf-dejavu
ttf-fantasque-sans-mono
ttf-hanazono
ttf-sazanami
tumbler
unzip
usbutils
vi
w3m
wget
which
wine
winetricks
wpa_supplicant
xfburn
xfce4-appfinder
xfce4-artwork
xfce4-battery-plugin
xfce4-clipman-plugin
xfce4-cpufreq-plugin
xfce4-cpugraph-plugin
xfce4-datetime-plugin
xfce4-dict
xfce4-diskperf-plugin
xfce4-eyes-plugin
xfce4-fsguard-plugin
xfce4-genmon-plugin
xfce4-mailwatch-plugin
xfce4-mount-plugin
xfce4-mpc-plugin
xfce4-netload-plugin
xfce4-notes-plugin
xfce4-notifyd
xfce4-panel
xfce4-power-manager
xfce4-pulseaudio-plugin
xfce4-screensaver
xfce4-screenshooter
xfce4-sensors-plugin
xfce4-session
xfce4-settings
xfce4-smartbookmark-plugin
xfce4-systemload-plugin
xfce4-taskmanager
xfce4-terminal
xfce4-time-out-plugin
xfce4-timer-plugin
xfce4-verve-plugin
xfce4-wavelan-plugin
xfce4-weather-plugin
xfce4-whiskermenu-plugin
xfce4-xkb-plugin
xfconf
xfdesktop
xfwm4
xfwm4-themes
xorg-fonts-misc
xorg-xev
xorg-xinit
xorg-xmodmap
xorg-xrdb
xscreensaver
xterm
zsh
