adobe-source-han-sans-jp-fonts
adobe-source-han-serif-jp-fonts
albert
alsa-utils
at
autoconf
automake
autopep8
awesome
base
bashtop
binutils
bison
code
cronie
dialog
efibootmgr
emacs
fakeroot
fcitx-configtool
fcitx-kkc
firefox
flake8
flameshot
flex
fzf
gauche
gcc
gdb
git
github-cli
glade
gnome-keyring
gnu-netcat
gobject-introspection
groff
grub
gtest
htop
hub
i3lock
ibus-anthy
ibus-kkc
ibus-skk
imagemagick
ipython
iw
jdk11-openjdk
kcachegrind
libkkc
libreoffice-fresh
linux
linux-firmware
lldb
m4
make
man-db
man-pages
maven
mlocate
mutt
mysql-workbench
namcap
netctl
networkmanager
ngrep
noto-fonts-cjk
nvidia
openconnect
openssh
otf-ipafont
pacman-contrib
patch
pavucontrol
perf
perl-lwp-protocol-https
pinta
pkgconf
pkgfile
pulseaudio
pybind11
python
python-atomicwrites
python-keyring
python-keyrings-alt
python-levenshtein
python-marisa
python-nose
python-pip
python-plyvel
python-pyflakes
python-pytest
python-regex
python-tqdm
rofi
rofi-calc
ruby
rust
rxvt-unicode
screen
skktools
strace
sudo
sway
swig
synergy
terminator
texinfo
the_silver_searcher
tk
tmux
tree
ttf-dejavu
ttf-fantasque-sans-mono
ttf-hanazono
ttf-sazanami
unzip
usbutils
vala
valgrind
vi
vim
w3m
weston
wget
which
wine
winetricks
wpa_supplicant
xbindkeys
xdo
xorg-fonts-misc
xorg-xev
xorg-xhost
xorg-xinit
xorg-xmodmap
xorg-xrandr
xorg-xrdb
xscreensaver
xterm
zsh
