alsa-utils
autoconf
automake
barrier
base
binutils
bison
code
cronie
dialog
efibootmgr
fakeroot
fcitx
fcitx-configtool
fcitx-mozc-ut-unified
fcitx-qt5
firefox
flex
fzf
gcc
git
gnu-netcat
google-chrome
groff
grub
gvim
i3lock
iw
jdk11-openjdk
jetbrains-toolbox
joplin
libreoffice-fresh
linux
linux-firmware
lv
m4
make
man-db
man-pages
mlocate
netctl
networkmanager
ngrep
noto-fonts-cjk
nvidia
openconnect
openssh
otf-ipafont
pacman-contrib
patch
pavucontrol
peco
pinta
pkgconf
polybar
pulseaudio
python
rofi
rxvt-unicode
siji-git
slack-desktop
stumpwm
sudo
terminator
texinfo
the_silver_searcher
tmux
tree
ttf-dejavu
ttf-fantasque-sans-mono
ttf-ms-fonts
unzip
vi
w3m
wget
which
wine
winetricks
wpa_supplicant
xorg-xinit
xorg-xmodmap
xorg-xrdb
xterm
yay
zoom
zsh
